{
  "backend/main.mo": "Actor manages user profiles and creation records with permission checks using AccessControl.",
  "feature_evidence.json": "Feature evidence listing affected frontend files and components for gallery usability filter and URL persistence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend components and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles.",
  "frontend/index.html": "Root HTML file mounting the app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes including usableOnly search validation and wraps app with ThemeProvider.",
  "frontend/src/components/AppFooter.tsx": "Footer showing caffeine.ai attribution and current year.",
  "frontend/src/components/AppHeader.tsx": "Header with logo, navigation links, and login button using router state.",
  "frontend/src/components/AppLayout.tsx": "Root layout rendering header, outlet content, and footer.",
  "frontend/src/components/Auth/LoginButton.tsx": "Button handling Internet Identity login/logout with loading states.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal prompting user for name during profile setup with save handling.",
  "frontend/src/components/Auth/RequireAuthenticated.tsx": "Guard component requiring authentication and showing login prompt if unauthenticated.",
  "frontend/src/components/Workspace/ExportPanel.tsx": "Provides UI controls to export individual PBR maps as PNG/JPG or download all maps as a ZIP, with loading states and toast notifications.",
  "frontend/src/components/Workspace/GenerationControls.tsx": "UI for selecting generation parameters like category, seed, variation, creative freedom, and description before triggering a texture generation.",
  "frontend/src/components/Workspace/MapSetPreview.tsx": "Displays a grid preview of all generated PBR maps with labels and color indicators.",
  "frontend/src/components/Workspace/PreviewModeTabs.tsx": "Two-option tab selector for switching between 2D map preview and 3D preview modes.",
  "frontend/src/components/Workspace/ReferenceGallery.tsx": "Allows uploading, validating, previewing, and removing reference images used for generation.",
  "frontend/src/components/Workspace/RunComposition.tsx": "Summarizes a generation run’s description, reference images, and creative freedom settings in a structured breakdown.",
  "frontend/src/components/Workspace/RunMetadata.tsx": "Shows metadata for a generation run including ID, timestamp, category, seed, resolution, and creative freedom status.",
  "frontend/src/components/Workspace/SaveCreationDialog.tsx": "Dialog for saving a creation to the user’s gallery, including title input, usability confirmation, thumbnail generation, and mutation handling.",
  "frontend/src/components/Workspace/Tiling3DPreview.tsx": "Renders a 3D preview of tileable PBR maps using react-three-fiber with adjustable repeat and lighting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps common backend queries and mutations for user profiles and creation records using react-query.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes.",
  "frontend/src/lib/creationRecords/settingsString.ts": "Generates a compact human‑readable settings string for a generation run.",
  "frontend/src/lib/creationRecords/thumbnail.ts": "Creates a resized JPEG thumbnail from an image data URL using canvas.",
  "frontend/src/lib/export/exportMaps.ts": "Converts and downloads PBR map images individually, supporting PNG/JPG export.",
  "frontend/src/lib/generation/creativeFreedomB.ts": "Applies Creative Freedom-B randomness parameters to modify seeds for generation.",
  "frontend/src/lib/generation/generateTileablePbr.ts": "Generates tileable PBR texture maps using seeded noise and creative freedom settings.",
  "frontend/src/lib/references/referenceValidation.ts": "Validates reference images by file type and size (max 10MB).",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CreationDetailPage.tsx": "Displays detailed information for a selected gallery creation, including metadata, preview image, and navigation back to the gallery.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a grid of saved creations with filtering, loading states, and navigation into individual detail pages.",
  "frontend/src/pages/WorkspacePage.tsx": "Provides the main texture generation workspace with controls, previews, reference images, and profile setup flow.",
  "frontend/src/types/generation.ts": "Defines TypeScript interfaces for PBR map sets, generation runs, reference images, and generation settings.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Defines overall project state, features, and architectural notes for a 4K tileable PBR texture generator. Includes metadata, existing features, and guidelines for persistence behavior."
}